Revit 2027 API
DataExchangeMessageSeverity Enumeration
 Error levels for DataExchangeLog
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DataExchangeMessageSeverity
Public Enumeration DataExchangeMessageSeverity
public enum class DataExchangeMessageSeverity
type DataExchangeMessageSeverity
Members
Member name | Value | Description
Error | 2 |  A problem. The converted data should be carefully examined and/or compared to the source data. The application may want to cancel the conversion process.
FatalError | 3 |  A serious problem that makes further data conversion pointless. The conversion process will be cancelled.
Info | 0 |  Informational message, such as successful creation fo a face, edge or a solid.
Warning | 1 |  A potential problem. The converted data should be carefully examined and/or compared to the source data
See Also
Reference
Autodesk.Revit.DB Namespace